scripts/putida_stir/nonreact/constant/thermophysicalProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version   	2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/constant/globalTransport"

thermoType
{
    type            heRhoThermo;
    mixture         multiComponentMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

species
(
    water
    CO2
    O2
);

defaultSpecie water;

"(mixture|water)"
{
    specie
    {
        molWeight   18.0153;
    }
    equationOfState
    {
        rho     $rho0MixLiq;
    }
    thermodynamics
    {
        Cp          $CpMixLiq;
        Hf          -1.5879e+07; // I think it is not used
    }
    transport
    {
        mu          $muMixLiq;
        Pr          $PrMixLiq;
    }
}

CO2
{
    specie
    {
        molWeight   44.00995;
    }
    equationOfState
    {
        rho     $rho0MixLiq;
    }
    thermodynamics
    {
        Cp          $CpMixLiq;
        Hf         -1.5879e+07;
    }
    transport
    {
        mu          $muMixLiq;
        Pr          $PrCO2;
    }
}

O2
{
    specie
    {
        molWeight   31.9988;
    }
    equationOfState
    {
        rho     $rho0MixLiq;
    }
    thermodynamics
    {
        Cp          $CpMixLiq;
        Hf          -365639;//-9402451;
    }
    transport
    {
        mu          $muMixLiq;
        Pr          $PrO2;
    }
}




// ************************************************************************* //
